load-testing/results/jwks-baseline.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /oauth2/jwks
Document Length:        429 bytes

Concurrency Level:      100
Time taken for tests:   4.758 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      3720000 bytes
HTML transferred:       2145000 bytes
Requests per second:    1050.89 [#/sec] (mean)
Time per request:       95.158 [ms] (mean)
Time per request:       0.952 [ms] (mean, across all concurrent requests)
Transfer rate:          763.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   10  17.1      2     171
Processing:     4   84  65.6     68     653
Waiting:        1   75  57.8     61     599
Total:          8   94  67.1     77     659

Percentage of the requests served within a certain time (ms)
  50%     77
  66%     96
  75%    110
  80%    118
  90%    154
  95%    225
  98%    309
  99%    349
 100%    659 (longest request)