load-testing/results/jwks-c300.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /oauth2/jwks
Document Length:        429 bytes

Concurrency Level:      300
Time taken for tests:   5.137 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      7440000 bytes
HTML transferred:       4290000 bytes
Requests per second:    1946.48 [#/sec] (mean)
Time per request:       154.124 [ms] (mean)
Time per request:       0.514 [ms] (mean, across all concurrent requests)
Transfer rate:          1414.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   71 239.3      5    1211
Processing:     5   69  50.3     58     544
Waiting:        1   60  46.1     47     538
Total:          7  141 249.9     72    1563

Percentage of the requests served within a certain time (ms)
  50%     72
  66%     90
  75%    107
  80%    120
  90%    177
  95%   1068
  98%   1142
  99%   1279
 100%   1563 (longest request)