load-testing/results/token-sustained-c10.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /oauth2/token
Document Length:        740 bytes

Concurrency Level:      10
Time taken for tests:   6.751 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      210000 bytes
Total body sent:        67200
HTML transferred:       148000 bytes
Requests per second:    29.63 [#/sec] (mean)
Time per request:       337.534 [ms] (mean)
Time per request:       33.753 [ms] (mean, across all concurrent requests)
Transfer rate:          30.38 [Kbytes/sec] received
                        9.72 kb/s sent
                        40.10 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       4
Processing:    92  329 113.1    316     676
Waiting:       92  327 112.9    315     676
Total:         92  329 113.0    317     676

Percentage of the requests served within a certain time (ms)
  50%    317
  66%    359
  75%    390
  80%    417
  90%    494
  95%    537
  98%    618
  99%    636
 100%    676 (longest request)