load-testing/results/token-sustained-c3.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /oauth2/token
Document Length:        740 bytes

Concurrency Level:      3
Time taken for tests:   4.414 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      105000 bytes
Total body sent:        33600
HTML transferred:       74000 bytes
Requests per second:    22.66 [#/sec] (mean)
Time per request:       132.420 [ms] (mean)
Time per request:       44.140 [ms] (mean, across all concurrent requests)
Transfer rate:          23.23 [Kbytes/sec] received
                        7.43 kb/s sent
                        30.66 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       4
Processing:    49  130  68.9    116     395
Waiting:       49  130  68.6    116     393
Total:         49  130  69.1    116     395

Percentage of the requests served within a certain time (ms)
  50%    116
  66%    134
  75%    147
  80%    150
  90%    221
  95%    316
  98%    375
  99%    395
 100%    395 (longest request)