load-testing/results/token-sustained-c30.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /oauth2/token
Document Length:        740 bytes

Concurrency Level:      30
Time taken for tests:   31.477 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      525000 bytes
Total body sent:        168000
HTML transferred:       370000 bytes
Requests per second:    15.88 [#/sec] (mean)
Time per request:       1888.614 [ms] (mean)
Time per request:       62.954 [ms] (mean, across all concurrent requests)
Transfer rate:          16.29 [Kbytes/sec] received
                        5.21 kb/s sent
                        21.50 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:   166 1858 3208.8   1050   15517
Waiting:      166 1853 3205.4   1049   15517
Total:        166 1859 3208.8   1050   15517

Percentage of the requests served within a certain time (ms)
  50%   1050
  66%   1234
  75%   1368
  80%   1435
  90%   1701
  95%  14193
  98%  14573
  99%  14926
 100%  15517 (longest request)